OpenFOAM/libAcoustics/libAcoustics-OFv1812/cases/FFWH+cfdbem_1D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 24.8084307131;

boundaryField
{
    sphere
    {
        type            fixedValue;
        value           uniform 24.8084307131;
    }

    free
    {
        type            zeroGradient;
    }

    #include "cyc";
}

// ************************************************************************* //
