OpenFOAM/libAcoustics/libAcoustics-OFv1812/cases/FFWH+cfdbem_1D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

# Get application directory
application=`getApplication`
runApplication $application 

# ----------------------------------------------------------------- end-of-file
